---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ArrayMixedModAndViewSpecElemsWarning
source: html/e68800b8-d1e7-c5a4-c281-670c09e743c3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ArrayFailures.ArrayMixedModAndViewSpecElemsWarning Property

You have selected a mixture of modeling and view specific elements to array in an associative manner. Only the model elements will remain grouped and associative.

## Syntax (C#)
```csharp
public static FailureDefinitionId ArrayMixedModAndViewSpecElemsWarning { get; }
```